# ----------------------------------- Taps ------------------------------------
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'ethereum/ethereum'

# ----------------------------------- Shell -----------------------------------
# Terminal emulator
cask 'alacritty'

# Shell
brew 'bash'
brew 'bash-completion'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Version Control System
brew 'git'

# Binaries
brew 'autojump'
brew 'bat'
brew 'exa'
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'htop'
brew 'neofetch'
brew 'pandoc'
brew 'ranger'
brew 'ripgrep'
brew 'starship'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'youtube-dl'

# ----------------------------------- Dev -------------------------------------
# Python
brew 'openssl'
brew 'readline'
brew 'sqlite3'
brew 'xz'
brew 'zlib'
brew 'pyenv'
brew 'pyenv-virtualenv'

# Rust
brew 'rustup'
brew 'rust-analyzer'

# Go
brew 'go'
brew 'gopls'

# Node.js
brew 'node'

# Lua
brew 'lua'

# R
cask 'r'
cask 'rstudio'

# Solidity
brew 'Solidity'

# Development Environments
cask 'virtualbox'
cask 'vagrant'

# ------------------------------ Editors & IDEs -------------------------------
brew 'vim'
brew 'neovim'
cask 'sublime-text'
cask 'pycharm'
cask 'datagrip'

# --------------------------------- Others ------------------------------------
# Browsers
cask 'brave-browser'
cask 'firefox'
cask 'google-chrome'

# Apps
cask '1password'
cask 'flux'
cask 'karabiner-elements'
cask 'obsidian'
cask 'rectangle'
casl 'signal'
cask 'slack'
cask 'spotify'
cask 'telegram'
cask 'whatsapp'

# Fonts
cask 'font-sauce-code-pro-nerd-font'
