# Shell
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Dev
brew 'git'
brew 'vim'
brew 'neovim'
brew 'awscli'
brew 'tree-sitter'
cask 'docker'
brew 'docker-compose'
cask 'ghostty'
cask 'wireshark'
brew 'postgresql'
brew 'redis'
brew 'pre-commit'

# Binaries
brew 'autojump'
brew 'eza'
brew 'bat'
brew 'fd'
brew 'fzf'
brew 'btop'
brew 'pandoc'
brew 'ripgrep'
brew 'sd'
brew 'jq'
brew 'starship'
brew 'stow'
brew 'tmux'
brew 'wget'
brew 'watch'

# Python
brew 'uv'
brew 'ruff'
brew 'pyenv'

# Node
brew 'nvm'
brew 'pnpm'
brew 'yarn'
brew 'oven-sh/bun/bun'

# Rust
brew 'rustup'
brew 'rust-analyzer'

# Go
brew 'go'
brew 'gopls'

# Lua
brew 'lua'
brew 'luarocks'
brew 'lua-language-server'

