# ----------------------------------- Taps ------------------------------------
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'ethereum/ethereum'

# ----------------------------------- Shell -----------------------------------
# Terminal emulator
cask 'alacritty'

# Shell
brew 'bash'
brew 'bash-completion'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Binaries
brew 'autojump'
brew 'bat'
brew 'bottom'
brew 'dust'
brew 'exa'
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'grex'
brew 'htop'
brew 'neofetch'
brew 'pandoc'
brew 'procs'
brew 'ranger'
brew 'ripgrep'
brew 'sd'
brew 'starship'
brew 'stow'
brew 'tealdeer'
brew 'tmux'
brew 'tokei'
brew 'tree'
brew 'wget'
brew 'youtube-dl'

# ----------------------------------- Dev -------------------------------------
## Version Control System
brew 'git'
brew 'lazygit'

# Python
cask 'miniconda'
brew 'pyright'

# Rust
brew 'rustup-init'
brew 'rust-analyzer'

# Go
brew 'go'
brew 'gopls'

# C/C++
brew 'llvm'

# Node.js
brew 'node'
brew 'prettier'

# Lua
brew 'lua'
brew 'luarocks'
brew 'stylua'
brew 'lua-language-server'

# R
cask 'r'

# Solidity
brew 'Solidity'

# Yaml
brew 'yaml-language-server'

# ------------------------------ Editors & IDEs -------------------------------
brew 'neovim'
brew 'vim'
cask 'datagrip'
cask 'pycharm'
cask 'rstudio'
cask 'sublime-text'

# --------------------------------- Others ------------------------------------
# Browsers
cask 'brave-browser'
cask 'chromium'
cask 'firefox'
cask 'google-chrome'

# Apps
cask '1password'
cask 'flux'
cask 'karabiner-elements'
cask 'notion'
cask 'obsidian'
cask 'obinskit'
cask 'rectangle'
cask 'signal'
cask 'slack'
cask 'spotify'
cask 'telegram'
cask 'whatsapp'

# Fonts
cask 'font-sauce-code-pro-nerd-font'
