# Taps
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

# Shells
brew 'bash'
brew 'fish'
brew 'zsh'

# Shell enhancements
brew 'bash-completion'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Development
brew 'python'
brew 'r'
brew 'go'
brew 'rustup'
brew 'node'

# Editor
brew 'neovim'       # Main text editor
brew 'vim'          # Update pre-installed version
cask 'emacs'        # Alternative text editor
cask 'sublime-text' # Alternative text editor

# IDE
cask 'pycharm'  # Python
cask 'datagrip' # SQL

# Version control
brew 'git'

# Terminal
cask 'alacritty'  # Main terminal emulator
cask 'iterm2'     # Alternative terminal emulator

# Browser
cask 'firefox'            # Main browser
cask 'google-chrome'      # Alternative browser

# Binaries
brew 'bat'      # Cat clone with syntax highlighting
brew 'exa'      # A modern replacement for ls
brew 'htop'     # Monitor system processes
brew 'neofetch' # Notebook specs
brew 'pandoc'   # Swiss-army knife
brew 'ranger'   # Console file manager
brew 'stow'     # Symlinks manager
brew 'tldr' # Command's examples
brew 'tmux'     # Terminal multiplexer
brew 'tree'     # Display folder structure
brew 'wget'     # Download files

# Apps
cask '1password'  # Password manager
cask 'alfred'     # Main spotlight
cask 'dozer'      # Menu bar customization
cask 'evernote'   # Note-taking app
cask 'flux'       # Adjust screen brightness
cask 'gephi'      # Graph visualization
cask 'notion'     # Daily planner | Data collection | Notebook
cask 'obsidian'   # Second brain
cask 'rectangle'  # Window manager
cask 'rstudio'    # IDE for R
cask 'slack'      # Corporate messaging app
cask 'spotify'    # Music app
cask 'vagrant'    # Set up remote machines
cask 'virtualbox' # Set up remote machines
cask 'whatsapp'   # Personal messaging app
cask 'discord'    # Chat app
cask 'keybase'    # Chat app

# Fonts
cask 'font-sauce-code-pro-nerd-font'

