# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

# Browsers
cask 'firefox'
cask 'google-chrome'

# Terminal, shells and plugins
cask 'alacritty'
brew 'bash'
brew 'zsh'
brew 'fish'
brew 'zsh-autosuggestions'
brew 'zsh-completions'

# Development
brew 'git'
brew 'python'
brew 'rustup'
brew 'go'
brew 'node'
cask 'r'
brew 'lua'
cask 'rstudio'
cask 'virtualbox'
cask 'vagrant'
brew 'efm-langserver'
cask 'karabiner-elements'

# Editors and IDEs
brew 'neovim'
brew 'vim'
cask 'sublime-text'
cask 'pycharm'
cask 'datagrip'
cask 'gephi'

# Productivity tools
cask 'notion'
cask 'obsidian'
cask 'slack'

# Binaries
brew 'autojump'
brew 'exa'
brew 'fzf'
brew 'htop'
brew 'neofetch'
brew 'pandoc'
brew 'ranger'
brew 'ripgrep'
brew 'stow'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'youtube-dl'

# Others
cask '1password'
cask 'flux'
cask 'keybase'
cask 'rectangle'
cask 'spotify'
cask 'telegram'
cask 'whatsapp'

# Fonts
cask 'font-sauce-code-pro-nerd-font'
